openfoam_runs/run_0026/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    hull.stl
    {
        type  triSurfaceMesh;
        name  hull;
        scale 0.001;   // convert mm -> metres
    }
}

castellatedMeshControls
{
    maxLocalCells       2000000;
    maxGlobalCells      4000000;
    minRefinementCells  5;
    maxLoadUnbalance    0.10;
    nCellsBetweenLevels 2;

    features
    (
        { file "hull.eMesh"; level 2; }
    );

    refinementSurfaces
    {
        hull
        {
            level (2 3);
            patchInfo { type wall; }
        }
    }

    refinementRegions {}

    // A point clearly inside the fluid domain (not inside hull)
    locationInMesh (-0.5 0.5 -0.4);

    resolveFeatureAngle     30;
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch    3;
    tolerance       2.0;
    nSolveIter      50;
    nRelaxIter      5;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes       true;
    expansionRatio      1.3;
    finalLayerThickness 0.3;
    minThickness        0.1;
    nGrow               0;

    featureAngle        60;
    nRelaxIter          3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals      3;
    nSmoothThickness    10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle  90;
    nBufferCellsNoExtrude 0;
    nLayerIter          50;

    layers
    {
        hull { nSurfaceLayers 4; }
    }
}

meshQualityControls
{
    maxNonOrtho         65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave          80;
    minFlatness         0.5;
    minVol              1e-13;
    minTetQuality       1e-30;
    minArea             -1;
    minTwist            0.02;
    minDeterminant      0.001;
    minFaceWeight       0.05;
    minVolRatio         0.01;
    minTriangleTwist    -1;
    nSmoothScale        4;
    errorReduction      0.75;
}

writeFlags ( scalarLevels layerSets layerFields );
mergeTolerance 1e-6;
